<details ><summary>apply for ruby-getting-started-terraform 2025-12-31 07:54:34 (UTC)</summary>
  <details ><summary>Apply output</summary>

```terraform
Terraform will perform the following actions:

  # aws_scheduler_schedule.stop_rds will be created
  + resource "aws_scheduler_schedule" "stop_rds" {
      + arn                          = (known after apply)
      + description                  = "Stop RDS instance at 23:00 JST daily"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "ruby-getting-started-stop-rds"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 14 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:rds:stopDBInstance"
          + input    = jsonencode(
                {
                  + DbInstanceIdentifier = "ruby-getting-started-mysql"
                }
            )
          + role_arn = "arn:aws:iam::786832920677:role/ruby-getting-started-scheduler-role"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
aws_scheduler_schedule.stop_rds: Creating...
aws_scheduler_schedule.stop_rds: Creation complete after 1s [id=default/ruby-getting-started-stop-rds]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

bastion_instance_id = "i-096998226f432cbc4"
connection_instructions = <<EOT
# 1. Connect to Bastion via SSM
aws ssm start-session --target i-096998226f432cbc4

# 2. RDS connection information
Database: ruby_getting_started
Endpoint: ruby-getting-started-mysql.ctz6dn0wk1gw.ap-northeast-1.rds.amazonaws.com
Port: 3306
Username: admin

# Retrieve password:
aws secretsmanager get-secret-value --secret-id arn:aws:secretsmanager:ap-northeast-1:786832920677:secret:ruby-getting-started-rds-password-xKcpWw --query SecretString --output text | jq -r .password

# Note: MySQL client installation requires NAT Gateway or public subnet access since the bastion is in a private subnet.

EOT
rds_database_name = "ruby_getting_started"
rds_endpoint = "ruby-getting-started-mysql.ctz6dn0wk1gw.ap-northeast-1.rds.amazonaws.com:3306"
rds_password_secret_arn = "arn:aws:secretsmanager:ap-northeast-1:786832920677:secret:ruby-getting-started-rds-password-xKcpWw"

```
</details>
</details>